isi-ies-group/MODBUS_RTU/STM32_migration/STM32Workspace/Window_control/Core/Src/storage.c
#include "storage.h"

#include <stddef.h>
#include <string.h>

#include "gps.h"
#include "global_structs.h"
#include "main.h"
#include "movement_parameters.h"
#include "stm32u5xx_hal_flash.h"
#include "stm32u5xx_hal_flash_ex.h"

#define STORAGE_MAGIC              0x57435631UL /* "WCV1": Window Control Variables v1. */
#define STORAGE_VERSION            4UL
#define STORAGE_LEGACY_VERSION     1UL
#define STORAGE_V2_VERSION         2UL
#define STORAGE_V3_VERSION         3UL
#define STORAGE_FLASH_ADDRESS      (FLASH_BASE + FLASH_SIZE - FLASH_PAGE_SIZE)
#define STORAGE_FLASH_BANK         FLASH_BANK_2
#define STORAGE_FLASH_PAGE         (FLASH_PAGE_NB - 1U)
#define STORAGE_COUNTRY_MAX        32U
#define STORAGE_PROGRAM_UNIT       16U

typedef struct
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t crc;

  double latitude;
  double longitude;
  double pan;
  double tilt;

  uint32_t tilt_correction;
  uint32_t auto_mode_on;
  uint32_t manual_time_on;
  uint32_t fsm_state;

  float x_pos;
  float z_pos;

  int32_t manual_year;
  int32_t manual_month;
  int32_t manual_day;
  int32_t manual_hour;
  int32_t manual_minute;
  int32_t manual_second;

  char country[STORAGE_COUNTRY_MAX];
} StorageRecordV1_t;

typedef struct
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t crc;

  double latitude;
  double longitude;
  double pan;
  double tilt;

  uint32_t tilt_correction;
  uint32_t auto_mode_on;
  uint32_t manual_time_on;
  uint32_t fsm_state;

  float x_pos;
  float z_pos;
  float movement_hysteresis_gain;
  float movement_hysteresis_offset_mm;

  int32_t manual_year;
  int32_t manual_month;
  int32_t manual_day;
  int32_t manual_hour;
  int32_t manual_minute;
  int32_t manual_second;

  char country[STORAGE_COUNTRY_MAX];
} StorageRecordV2_t;

typedef struct
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t crc;

  double latitude;
  double longitude;
  double pan;
  double tilt;

  uint32_t tilt_correction;
  uint32_t auto_mode_on;
  uint32_t manual_time_on;
  uint32_t fsm_state;

  float x_pos;
  float z_pos;
  float movement_hysteresis_gain;
  float movement_hysteresis_offset_mm;
  float vertical_movement_hysteresis_gain;
  float vertical_movement_hysteresis_offset_mm;

  int32_t manual_year;
  int32_t manual_month;
  int32_t manual_day;
  int32_t manual_hour;
  int32_t manual_minute;
  int32_t manual_second;

  char country[STORAGE_COUNTRY_MAX];
} StorageRecordV3_t;

typedef struct
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t crc;

  double latitude;
  double longitude;
  double pan;
  double tilt;

  uint32_t tilt_correction;
  uint32_t auto_mode_on;
  uint32_t manual_time_on;
  uint32_t fsm_state;

  float x_pos;
  float z_pos;
  float movement_hysteresis_gain;
  float movement_hysteresis_offset_mm;
  float vertical_movement_hysteresis_gain;
  float vertical_movement_hysteresis_offset_mm;
  float movement_max_x_mm;
  float movement_max_z_mm;
  uint32_t movement_speed_us;
  uint32_t movement_home_speed_us;

  int32_t manual_year;
  int32_t manual_month;
  int32_t manual_day;
  int32_t manual_hour;
  int32_t manual_minute;
  int32_t manual_second;

  char country[STORAGE_COUNTRY_MAX];
} StorageRecord_t;

static StorageRecord_t storage_cache;
static bool storage_cache_valid = false;
static bool storage_record_was_valid = false;
static volatile bool storage_save_in_progress = false;

/*
 * What: calculate a checksum for the persistent record.
 * How: walks every byte except the crc field itself with a small FNV-style hash.
 * Why: lets boot ignore erased/corrupted flash instead of loading unsafe globals.
 */
static uint32_t Storage_CalculateCrcBytes(const void *record,
                                          size_t record_size,
                                          size_t crc_offset,
                                          size_t crc_size)
{
  uint32_t crc = 2166136261UL;
  const uint8_t *bytes = (const uint8_t *)record;

  for (size_t i = 0U; i < record_size; i++)
  {
    if ((i >= crc_offset) && (i < (crc_offset + crc_size)))
    {
      continue;
    }

    crc ^= bytes[i];
    crc *= 16777619UL;
  }

  return crc;
}

static uint32_t Storage_CalculateCrcV1(const StorageRecordV1_t *record)
{
  return Storage_CalculateCrcBytes(record,
                                   sizeof(StorageRecordV1_t),
                                   offsetof(StorageRecordV1_t, crc),
                                   sizeof(record->crc));
}

static uint32_t Storage_CalculateCrcV2(const StorageRecordV2_t *record)
{
  return Storage_CalculateCrcBytes(record,
                                   sizeof(StorageRecordV2_t),
                                   offsetof(StorageRecordV2_t, crc),
                                   sizeof(record->crc));
}

static uint32_t Storage_CalculateCrcV3(const StorageRecordV3_t *record)
{
  return Storage_CalculateCrcBytes(record,
                                   sizeof(StorageRecordV3_t),
                                   offsetof(StorageRecordV3_t, crc),
                                   sizeof(record->crc));
}

static uint32_t Storage_CalculateCrc(const StorageRecord_t *record)
{
  return Storage_CalculateCrcBytes(record,
                                   sizeof(StorageRecord_t),
                                   offsetof(StorageRecord_t, crc),
                                   sizeof(record->crc));
}

/*
 * What: create the first-boot values for configuration, state, position and time mode.
 * How: fills one complete record, then calculates its crc as if it came from flash.
 * Why: keeps STM32 startup behavior close to ESP32 loadData() when no NVS data exists.
 */
static void Storage_SetDefaults(StorageRecord_t *record)
{
  (void)memset(record, 0, sizeof(*record));

  record->magic = STORAGE_MAGIC;
  record->version = STORAGE_VERSION;
  record->size = sizeof(StorageRecord_t);
  record->latitude = 40.4168;
  record->longitude = -3.7038;
  record->pan = 0.0;
  record->tilt = 0.0;
  record->tilt_correction = 0U;
  record->auto_mode_on = 0U;
  record->manual_time_on = 0U;
  record->fsm_state = (uint32_t)STDBY;
  record->x_pos = 0.0f;
  record->z_pos = 0.0f;
  record->movement_hysteresis_gain = MOVEMENT_HYSTERESIS_DEFAULT_GAIN;
  record->movement_hysteresis_offset_mm = MOVEMENT_HYSTERESIS_DEFAULT_OFFSET_MM;
  record->vertical_movement_hysteresis_gain = VERTICAL_MOVEMENT_HYSTERESIS_DEFAULT_GAIN;
  record->vertical_movement_hysteresis_offset_mm = VERTICAL_MOVEMENT_HYSTERESIS_DEFAULT_OFFSET_MM;
  record->movement_max_x_mm = MOVEMENT_DEFAULT_MAX_X_MM;
  record->movement_max_z_mm = MOVEMENT_DEFAULT_MAX_Z_MM;
  record->movement_speed_us = MOVEMENT_DEFAULT_STEP_DELAY_US;
  record->movement_home_speed_us = MOVEMENT_DEFAULT_HOME_STEP_DELAY_US;
  record->manual_year = 2026;
  record->manual_month = 1;
  record->manual_day = 1;
  record->manual_hour = 0;
  record->manual_minute = 0;
  record->manual_second = 0;
  (void)strncpy(record->country, "Spain", sizeof(record->country) - 1U);
  record->crc = Storage_CalculateCrc(record);
}

