isi-ies-group/MODBUS_RTU/STM32_migration/STM32Workspace/Window_control/Core/Src/storage.c
static bool Storage_IsMovementConfigValid(float gain, float offset_mm)
{
  return MovementParameters_IsGainValid(gain) &&
         MovementParameters_IsOffsetMmValid(offset_mm);
}

static bool Storage_IsMovementRangeConfigValid(float max_x_mm, float max_z_mm)
{
  return MovementParameters_IsRangeMmValid(max_x_mm) &&
         MovementParameters_IsRangeMmValid(max_z_mm);
}

static bool Storage_IsMovementSpeedConfigValid(uint32_t movement_speed_us,
                                               uint32_t movement_home_speed_us)
{
  return MovementParameters_IsSpeedUsValid(movement_speed_us) &&
         MovementParameters_IsSpeedUsValid(movement_home_speed_us);
}

static bool Storage_IsLegacyRecordValid(const StorageRecordV1_t *record)
{
  if ((record->magic != STORAGE_MAGIC) ||
      (record->version != STORAGE_LEGACY_VERSION) ||
      (record->size != sizeof(StorageRecordV1_t)) ||
      (record->fsm_state > (uint32_t)EPH_INPUT) ||
      (record->manual_year < 2000) ||
      (record->manual_year > 3000) ||
      (record->manual_month < 1) ||
      (record->manual_month > 12) ||
      (record->manual_day < 1) ||
      (record->manual_day > 31) ||
      (record->manual_hour < 0) ||
      (record->manual_hour > 23) ||
      (record->manual_minute < 0) ||
      (record->manual_minute > 59) ||
      (record->manual_second < 0) ||
      (record->manual_second > 59) ||
      (record->country[0] == '\0'))
  {
    return false;
  }

  return (record->crc == Storage_CalculateCrcV1(record));
}

static bool Storage_IsV2RecordValid(const StorageRecordV2_t *record)
{
  if ((record->magic != STORAGE_MAGIC) ||
      (record->version != STORAGE_V2_VERSION) ||
      (record->size != sizeof(StorageRecordV2_t)) ||
      (record->fsm_state > (uint32_t)EPH_INPUT) ||
      (record->manual_year < 2000) ||
      (record->manual_year > 3000) ||
      (record->manual_month < 1) ||
      (record->manual_month > 12) ||
      (record->manual_day < 1) ||
      (record->manual_day > 31) ||
      (record->manual_hour < 0) ||
      (record->manual_hour > 23) ||
      (record->manual_minute < 0) ||
      (record->manual_minute > 59) ||
      (record->manual_second < 0) ||
      (record->manual_second > 59) ||
      (!Storage_IsMovementConfigValid(record->movement_hysteresis_gain,
                                      record->movement_hysteresis_offset_mm)) ||
      (record->country[0] == '\0'))
  {
    return false;
  }

  return (record->crc == Storage_CalculateCrcV2(record));
}

static bool Storage_IsV3RecordValid(const StorageRecordV3_t *record)
{
  if ((record->magic != STORAGE_MAGIC) ||
      (record->version != STORAGE_V3_VERSION) ||
      (record->size != sizeof(StorageRecordV3_t)) ||
      (record->fsm_state > (uint32_t)EPH_INPUT) ||
      (record->manual_year < 2000) ||
      (record->manual_year > 3000) ||
      (record->manual_month < 1) ||
      (record->manual_month > 12) ||
      (record->manual_day < 1) ||
      (record->manual_day > 31) ||
      (record->manual_hour < 0) ||
      (record->manual_hour > 23) ||
      (record->manual_minute < 0) ||
      (record->manual_minute > 59) ||
      (record->manual_second < 0) ||
      (record->manual_second > 59) ||
      (!Storage_IsMovementConfigValid(record->movement_hysteresis_gain,
                                      record->movement_hysteresis_offset_mm)) ||
      (!Storage_IsMovementConfigValid(record->vertical_movement_hysteresis_gain,
                                      record->vertical_movement_hysteresis_offset_mm)) ||
      (record->country[0] == '\0'))
  {
    return false;
  }

  return (record->crc == Storage_CalculateCrcV3(record));
}

static void Storage_MigrateLegacyRecord(const StorageRecordV1_t *legacy,
                                        StorageRecord_t *record)
{
  Storage_SetDefaults(record);

  record->latitude = legacy->latitude;
  record->longitude = legacy->longitude;
  record->pan = legacy->pan;
  record->tilt = legacy->tilt;
  record->tilt_correction = legacy->tilt_correction;
  record->auto_mode_on = legacy->auto_mode_on;
  record->manual_time_on = legacy->manual_time_on;
  record->fsm_state = legacy->fsm_state;
  record->x_pos = legacy->x_pos;
  record->z_pos = legacy->z_pos;
  record->manual_year = legacy->manual_year;
  record->manual_month = legacy->manual_month;
  record->manual_day = legacy->manual_day;
  record->manual_hour = legacy->manual_hour;
  record->manual_minute = legacy->manual_minute;
  record->manual_second = legacy->manual_second;
  (void)strncpy(record->country, legacy->country, sizeof(record->country) - 1U);
  record->country[sizeof(record->country) - 1U] = '\0';
  record->crc = Storage_CalculateCrc(record);
}

static void Storage_MigrateV2Record(const StorageRecordV2_t *v2,
                                    StorageRecord_t *record)
{
  Storage_SetDefaults(record);

  record->latitude = v2->latitude;
  record->longitude = v2->longitude;
  record->pan = v2->pan;
  record->tilt = v2->tilt;
  record->tilt_correction = v2->tilt_correction;
  record->auto_mode_on = v2->auto_mode_on;
  record->manual_time_on = v2->manual_time_on;
  record->fsm_state = v2->fsm_state;
  record->x_pos = v2->x_pos;
  record->z_pos = v2->z_pos;
  record->movement_hysteresis_gain = v2->movement_hysteresis_gain;
  record->movement_hysteresis_offset_mm = v2->movement_hysteresis_offset_mm;
  record->manual_year = v2->manual_year;
  record->manual_month = v2->manual_month;
  record->manual_day = v2->manual_day;
  record->manual_hour = v2->manual_hour;
  record->manual_minute = v2->manual_minute;
  record->manual_second = v2->manual_second;
  (void)strncpy(record->country, v2->country, sizeof(record->country) - 1U);
  record->country[sizeof(record->country) - 1U] = '\0';
  record->crc = Storage_CalculateCrc(record);
}

static void Storage_MigrateV3Record(const StorageRecordV3_t *v3,
                                    StorageRecord_t *record)
{
  Storage_SetDefaults(record);

  record->latitude = v3->latitude;
  record->longitude = v3->longitude;
  record->pan = v3->pan;
  record->tilt = v3->tilt;
  record->tilt_correction = v3->tilt_correction;
  record->auto_mode_on = v3->auto_mode_on;
  record->manual_time_on = v3->manual_time_on;
  record->fsm_state = v3->fsm_state;
  record->x_pos = v3->x_pos;
  record->z_pos = v3->z_pos;
  record->movement_hysteresis_gain = v3->movement_hysteresis_gain;
  record->movement_hysteresis_offset_mm = v3->movement_hysteresis_offset_mm;
  record->vertical_movement_hysteresis_gain = v3->vertical_movement_hysteresis_gain;
  record->vertical_movement_hysteresis_offset_mm = v3->vertical_movement_hysteresis_offset_mm;
  record->manual_year = v3->manual_year;
  record->manual_month = v3->manual_month;
  record->manual_day = v3->manual_day;
  record->manual_hour = v3->manual_hour;
  record->manual_minute = v3->manual_minute;
  record->manual_second = v3->manual_second;
  (void)strncpy(record->country, v3->country, sizeof(record->country) - 1U);
  record->country[sizeof(record->country) - 1U] = '\0';
  record->crc = Storage_CalculateCrc(record);
}

