isi-ies-group/MODBUS_RTU/STM32_migration/STM32Workspace/Window_control/Core/Src/storage.c
/*
 * What: decide whether the flash page contains a usable Window Control record.
 * How: checks identity fields, basic ranges, country string and the stored crc.
 * Why: protects the application from random flash contents after erase/program loss.
 */
static bool Storage_IsRecordValid(const StorageRecord_t *record)
{
  if ((record->magic != STORAGE_MAGIC) ||
      (record->version != STORAGE_VERSION) ||
      (record->size != sizeof(StorageRecord_t)) ||
      (record->fsm_state > (uint32_t)EPH_INPUT) ||
      (record->manual_year < 2000) ||
      (record->manual_year > 3000) ||
      (record->manual_month < 1) ||
      (record->manual_month > 12) ||
      (record->manual_day < 1) ||
      (record->manual_day > 31) ||
      (record->manual_hour < 0) ||
      (record->manual_hour > 23) ||
      (record->manual_minute < 0) ||
      (record->manual_minute > 59) ||
      (record->manual_second < 0) ||
      (record->manual_second > 59) ||
      (!Storage_IsMovementConfigValid(record->movement_hysteresis_gain,
                                      record->movement_hysteresis_offset_mm)) ||
      (!Storage_IsMovementConfigValid(record->vertical_movement_hysteresis_gain,
                                      record->vertical_movement_hysteresis_offset_mm)) ||
      (!Storage_IsMovementRangeConfigValid(record->movement_max_x_mm,
                                           record->movement_max_z_mm)) ||
      (!Storage_IsMovementSpeedConfigValid(record->movement_speed_us,
                                           record->movement_home_speed_us)) ||
      (record->country[0] == '\0'))
  {
    return false;
  }

  return (record->crc == Storage_CalculateCrc(record));
}

/*
 * What: copy the persistent page from flash into RAM.
 * How: treats the last flash page as a StorageRecord_t and validates the result.
 * Why: flash cannot be edited field-by-field, so later saves work from a RAM cache.
 */
static bool Storage_ReadRecord(StorageRecord_t *record)
{
  const StorageRecord_t *flash_record = (const StorageRecord_t *)STORAGE_FLASH_ADDRESS;
  const StorageRecordV3_t *flash_v3_record = (const StorageRecordV3_t *)STORAGE_FLASH_ADDRESS;
  const StorageRecordV2_t *flash_v2_record = (const StorageRecordV2_t *)STORAGE_FLASH_ADDRESS;
  const StorageRecordV1_t *flash_legacy_record = (const StorageRecordV1_t *)STORAGE_FLASH_ADDRESS;
  StorageRecordV3_t v3_record;
  StorageRecordV2_t v2_record;
  StorageRecordV1_t legacy_record;

  (void)memcpy(record, flash_record, sizeof(*record));
  if (Storage_IsRecordValid(record))
  {
    return true;
  }

  (void)memcpy(&v3_record, flash_v3_record, sizeof(v3_record));
  if (Storage_IsV3RecordValid(&v3_record))
  {
    Storage_MigrateV3Record(&v3_record, record);
    return true;
  }

  (void)memcpy(&v2_record, flash_v2_record, sizeof(v2_record));
  if (Storage_IsV2RecordValid(&v2_record))
  {
    Storage_MigrateV2Record(&v2_record, record);
    return true;
  }

  (void)memcpy(&legacy_record, flash_legacy_record, sizeof(legacy_record));
  if (Storage_IsLegacyRecordValid(&legacy_record))
  {
    Storage_MigrateLegacyRecord(&legacy_record, record);
    return true;
  }

  return false;
}

/*
 * What: load the saved local timestamp into the STM32 RTC.
 * How: converts the stored calendar fields into struct tm and calls RTC_SetFromTM().
 * Why: after reset/power loss the clock must resume from the latest persisted local time.
 */
static void Storage_ApplyRecordToRtc(const StorageRecord_t *record)
{
  struct tm stored_time = {0};

  stored_time.tm_year = record->manual_year - 1900;
  stored_time.tm_mon = record->manual_month - 1;
  stored_time.tm_mday = record->manual_day;
  stored_time.tm_hour = record->manual_hour;
  stored_time.tm_min = record->manual_minute;
  stored_time.tm_sec = record->manual_second;

  RTC_SetFromTM(&stored_time);
}

/*
 * What: publish stored values into the globals used by config, FSM, GPS and movement.
 * How: copies each persisted field to its runtime owner and restores RTC from saved local time.
 * Why: after boot, the rest of the firmware can keep using the same globals as before.
 */
static void Storage_ApplyRecordToGlobals(const StorageRecord_t *record)
{
  g_SPAInputs.latitude = record->latitude;
  g_SPAInputs.longitude = record->longitude;
  g_AOIInputs.pan = record->pan;
  g_AOIInputs.tilt = record->tilt;
  g_AOIInputs.tilt_correction = (record->tilt_correction != 0U);

  (void)strncpy(g_country, record->country, sizeof(g_country) - 1U);
  g_country[sizeof(g_country) - 1U] = '\0';

  auto_on = (record->auto_mode_on != 0U);
  manual_time = (record->manual_time_on != 0U);
  thisSt = (States)record->fsm_state;
  nextSt = thisSt;

  g_x_val = record->x_pos;
  g_z_val = record->z_pos;
  g_x_target = g_x_val;
  g_z_target = g_z_val;
  g_movement_hysteresis_gain = record->movement_hysteresis_gain;
  g_movement_hysteresis_offset_mm = record->movement_hysteresis_offset_mm;
  g_vertical_movement_hysteresis_gain = record->vertical_movement_hysteresis_gain;
  g_vertical_movement_hysteresis_offset_mm = record->vertical_movement_hysteresis_offset_mm;
  g_movement_max_x_mm = MovementParameters_ValidatedRangeMm(record->movement_max_x_mm,
                                                            MOVEMENT_DEFAULT_MAX_X_MM);
  g_movement_max_z_mm = MovementParameters_ValidatedRangeMm(record->movement_max_z_mm,
                                                            MOVEMENT_DEFAULT_MAX_Z_MM);
  g_movement_speed_us = MovementParameters_ValidatedSpeedUs(record->movement_speed_us,
                                                            MOVEMENT_DEFAULT_STEP_DELAY_US);
  g_movement_home_speed_us = MovementParameters_ValidatedSpeedUs(record->movement_home_speed_us,
                                                                 MOVEMENT_DEFAULT_HOME_STEP_DELAY_US);

  Storage_ApplyRecordToRtc(record);
}

/*
 * What: copy the current RTC calendar into the persistent record cache.
 * How: reads RTC through RTC_GetToTM() and stores year/month/day/hour/min/sec fields.
 * Why: periodic saves must keep the reboot fallback clock close to real local time.
 */
static void Storage_UpdateCacheFromRtc(void)
{
  struct tm rtc_time = {0};

