isi-ies-group/MODBUS_RTU/STM32_migration/STM32Workspace/Window_control/Core/Src/storage.c
  RTC_GetToTM(&rtc_time);

  storage_cache.manual_year = rtc_time.tm_year + 1900;
  storage_cache.manual_month = rtc_time.tm_mon + 1;
  storage_cache.manual_day = rtc_time.tm_mday;
  storage_cache.manual_hour = rtc_time.tm_hour;
  storage_cache.manual_minute = rtc_time.tm_min;
  storage_cache.manual_second = rtc_time.tm_sec;
}

/*
 * What: refresh the flash cache from the current runtime globals.
 * How: reads configuration, state, position and time-mode flags, then recalculates crc.
 * Why: every save writes one full record, so unchanged fields must be preserved too.
 */
static void Storage_UpdateCacheFromGlobals(void)
{
  States persistent_state = fsmGetPersistentState();

  storage_cache.magic = STORAGE_MAGIC;
  storage_cache.version = STORAGE_VERSION;
  storage_cache.size = sizeof(StorageRecord_t);

  storage_cache.latitude = g_SPAInputs.latitude;
  storage_cache.longitude = g_SPAInputs.longitude;
  storage_cache.pan = g_AOIInputs.pan;
  storage_cache.tilt = g_AOIInputs.tilt;
  storage_cache.tilt_correction = g_AOIInputs.tilt_correction ? 1U : 0U;

  storage_cache.auto_mode_on = (persistent_state == AUTO_MODE) ? 1U : 0U;
  storage_cache.manual_time_on = manual_time ? 1U : 0U;
  storage_cache.fsm_state = (uint32_t)persistent_state;
  storage_cache.x_pos = g_x_val;
  storage_cache.z_pos = g_z_val;
  storage_cache.movement_hysteresis_gain = g_movement_hysteresis_gain;
  storage_cache.movement_hysteresis_offset_mm = g_movement_hysteresis_offset_mm;
  storage_cache.vertical_movement_hysteresis_gain = g_vertical_movement_hysteresis_gain;
  storage_cache.vertical_movement_hysteresis_offset_mm = g_vertical_movement_hysteresis_offset_mm;
  storage_cache.movement_max_x_mm = MovementParameters_ValidatedRangeMm(g_movement_max_x_mm,
                                                                        MOVEMENT_DEFAULT_MAX_X_MM);
  storage_cache.movement_max_z_mm = MovementParameters_ValidatedRangeMm(g_movement_max_z_mm,
                                                                        MOVEMENT_DEFAULT_MAX_Z_MM);
  storage_cache.movement_speed_us = MovementParameters_ValidatedSpeedUs(g_movement_speed_us,
                                                                        MOVEMENT_DEFAULT_STEP_DELAY_US);
  storage_cache.movement_home_speed_us = MovementParameters_ValidatedSpeedUs(g_movement_home_speed_us,
                                                                             MOVEMENT_DEFAULT_HOME_STEP_DELAY_US);

  (void)strncpy(storage_cache.country, g_country, sizeof(storage_cache.country) - 1U);
  storage_cache.country[sizeof(storage_cache.country) - 1U] = '\0';

  storage_cache.crc = Storage_CalculateCrc(&storage_cache);
}

/*
 * What: erase and rewrite the persistent storage page.
 * How: unlocks flash, erases the selected page, then programs 16-byte STM32U5 quadwords.
 * Why: this emulates the ESP32 Preferences/NVS save step with the STM32 internal flash.
 */
static bool Storage_WriteCacheToFlash(void)
{
  FLASH_EraseInitTypeDef erase = {0};
  uint32_t page_error = 0U;
  uint32_t address = STORAGE_FLASH_ADDRESS;
  const uint8_t *source = (const uint8_t *)&storage_cache;
  size_t remaining = sizeof(storage_cache);
  HAL_StatusTypeDef status;

  if (storage_save_in_progress)
  {
    return false;
  }

  storage_save_in_progress = true;

  erase.TypeErase = FLASH_TYPEERASE_PAGES;
  erase.Banks = STORAGE_FLASH_BANK;
  erase.Page = STORAGE_FLASH_PAGE;
  erase.NbPages = 1U;

  status = HAL_FLASH_Unlock();
  if (status == HAL_OK)
  {
    status = HAL_FLASHEx_Erase(&erase, &page_error);
  }

  while ((status == HAL_OK) && (remaining > 0U))
  {
    uint32_t quadword[4] = {0xFFFFFFFFUL, 0xFFFFFFFFUL, 0xFFFFFFFFUL, 0xFFFFFFFFUL};
    size_t chunk = (remaining >= STORAGE_PROGRAM_UNIT) ? STORAGE_PROGRAM_UNIT : remaining;

    (void)memcpy(quadword, source, chunk);
    status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_QUADWORD, address, (uint32_t)quadword);
    address += STORAGE_PROGRAM_UNIT;
    source += chunk;
    remaining -= chunk;
  }

  (void)HAL_FLASH_Lock();
  storage_save_in_progress = false;

  return (status == HAL_OK);
}

/*
 * What: persist the latest runtime globals.
 * How: initializes the cache if needed, refreshes it from globals and writes flash.
 * Why: gives saveData/saveState/savePos one common path so the record format stays coherent.
 */
static bool Storage_SaveCurrentGlobals(void)
{
  if (!storage_cache_valid)
  {
    Storage_SetDefaults(&storage_cache);
    storage_cache_valid = true;
  }

  Storage_UpdateCacheFromGlobals();

  return Storage_WriteCacheToFlash();
}

/*
 * What: load configuration, state, position and time mode during application startup.
 * How: reads flash, falls back to defaults if invalid, and applies the record to globals.
 * Why: startup should recover the same operating point after reset or power loss.
 */
bool Storage_LoadAll(void)
{
  storage_record_was_valid = Storage_ReadRecord(&storage_cache);

  if (!storage_record_was_valid)
  {
    Storage_SetDefaults(&storage_cache);
  }

  storage_cache_valid = true;
  Storage_ApplyRecordToGlobals(&storage_cache);

  return storage_record_was_valid;
}

/*
 * What: save configuration values.
 * How: copies the current config globals into the cached record and writes flash.
 * Why: mirrors ESP32 saveData() so configuration survives reset and power loss.
 */
bool saveData(void)
{
  return Storage_SaveCurrentGlobals();
}

/*
 * What: save the current FSM state.
 * How: records thisSt and the synchronized auto_on flag in the flash record.
 * Why: later low-power/reboot flows can resume from the last logical mode.
 */
bool saveState(void)
{
  return Storage_SaveCurrentGlobals();
}

/*
 * What: save the latest software X/Z position.
 * How: stores g_x_val and g_z_val after movement or homing completes.
 * Why: after power loss the firmware can restart with the last known mechanism position.
 */
bool savePos(void)
{
  return Storage_SaveCurrentGlobals();
}

/*
 * What: save movement calibration values.
 * How: stores the current gain, offset, range and speed globals inside the same flash-backed record.
 * Why: calibration changes from WiFi or any future non-WiFi input must survive reset and power loss.
 */
bool saveMovementConfig(void)
{
  return Storage_SaveCurrentGlobals();
}

