isi-ies-group/MODBUS_RTU/STM32_migration/STM32Workspace/Window_control/Core/Src/storage.c
/*
 * What: save a manually entered local date/time.
 * How: stores the timestamp fields and marks manual_time as active before writing flash.
 * Why: if RTC stops after power loss, boot can reuse this manual time until GPS sync wins.
 */
bool saveManualTime(int year, int month, int day, int hour, int minute, int second)
{
  if (!storage_cache_valid)
  {
    Storage_SetDefaults(&storage_cache);
    storage_cache_valid = true;
  }

  storage_cache.manual_year = year;
  storage_cache.manual_month = month;
  storage_cache.manual_day = day;
  storage_cache.manual_hour = hour;
  storage_cache.manual_minute = minute;
  storage_cache.manual_second = second;
  manual_time = true;

  return Storage_SaveCurrentGlobals();
}

/*
 * What: save whether RTC time currently comes from manual input or GPS.
 * How: updates only the manual_time flag and preserves the last manual timestamp fields.
 * Why: pressing Sync Time must switch the source back to GPS without losing fallback data.
 */
bool saveTimeMode(bool is_manual_time)
{
  if (!storage_cache_valid)
  {
    Storage_SetDefaults(&storage_cache);
    storage_cache_valid = true;
  }

  manual_time = is_manual_time;
  Storage_UpdateCacheFromRtc();
  return Storage_SaveCurrentGlobals();
}

/*
 * What: save the current RTC local time without changing config/state/position.
 * How: reads RTC into the cached timestamp fields and writes the complete flash record.
 * Why: after reset the firmware should restart from the latest known local clock value.
 */
bool saveRtcTime(void)
{
  if (!storage_cache_valid)
  {
    Storage_SetDefaults(&storage_cache);
    storage_cache_valid = true;
  }

  Storage_UpdateCacheFromRtc();
  return Storage_SaveCurrentGlobals();
}

/*
 * What: reload all stored values through the ESP32-style loadData() entry point.
 * How: delegates to Storage_LoadAll() because STM32 stores one coherent record.
 * Why: keeps old call sites familiar while avoiding split flash records.
 */
bool loadData(void)
{
  return Storage_LoadAll();
}

/*
 * What: reload FSM state through the ESP32-style loadState() entry point.
 * How: delegates to Storage_LoadAll() and reapplies the complete record.
 * Why: state, config and position are intentionally restored as one consistent snapshot.
 */
bool loadState(void)
{
  return Storage_LoadAll();
}

/*
 * What: reload X/Z position through the ESP32-style loadPos() entry point.
 * How: delegates to Storage_LoadAll() and reapplies the complete record.
 * Why: avoids mixing a new position with stale configuration/state fields.
 */
bool loadPos(void)
{
  return Storage_LoadAll();
}

/*
 * What: reload manual time mode and its stored timestamp.
 * How: delegates to Storage_LoadAll(), which calls setManualTime() when needed.
 * Why: RTC recovery is part of the same startup snapshot as the rest of the app.
 */
bool loadManualTime(void)
{
  return Storage_LoadAll();
}

/*
 * What: expose whether boot used a valid flash record or defaults.
 * How: returns the validation result captured during Storage_LoadAll().
 * Why: status/debug code can tell if persistence is actually being used.
 */
bool Storage_HasValidRecord(void)
{
  return storage_record_was_valid;
}
